#renaming such as "第二十六课..." to "第26课..."
import os
dir = os.getcwd()
print("Current direcotyr is \""+dir+"\"")
files = os.listdir(dir)
titles = [
		"第五十九", "第五十八", "第五十七", "第五十六", "第五十五", 
		"第五十四", "第五十三", "第五十二", "第五十一", "第五十",
		"第四十九",	"第四十八",	"第四十七",	"第四十六",	"第四十五",
		"第四十四",	"第四十三",	"第四十二",	"第四十一",	"第四十",
		"第三十九",	"第三十八",	"第三十七",	"第三十六",	"第三十五",
		"第三十四",	"第三十三",	"第三十二",	"第三十一",	"第三十",
		"第二十九",	"第二十八",	"第二十七",	"第二十六",	"第二十五",
		"第二十四",	"第二十三",	"第二十二",	"第二十一",	"第二十",
		"第十九",	"第十八",	"第十七",	"第十六",	"第十五",
		"第十四",	"第十三",	"第十二",	"第十一",	"第十",
		"第九",	"第八",	"第七",	"第六",	"第五",
		"第四",	"第三",	"第二",	"第一",	"第零"]
		
newtitles = [
		"第59", "第58", "第57", "第56", "第55", 
		"第54", "第53", "第52", "第51", "第50",
		"第49",	"第48",	"第47",	"第46",	"第45",
		"第44",	"第43",	"第42",	"第41",	"第40",
		"第39",	"第38",	"第37",	"第36",	"第35",
		"第34",	"第33",	"第32",	"第31",	"第30",
		"第29",	"第28",	"第27",	"第26",	"第25",
		"第24",	"第23",	"第22",	"第21",	"第20",
		"第19",	"第18",	"第17",	"第16",	"第15",
		"第14",	"第13",	"第12",	"第11",	"第10",
		"第09",	"第08",	"第07",	"第06",	"第05",
		"第04",	"第03",	"第02",	"第01",	"第00",
		]

for fn in files:
	#print(fn)
	for i in range(len(titles)):
		pos=fn.find(titles[i])
		if(pos==0):
			l = len(titles[i]);
			post = fn[l:]
			newname = newtitles[i] + post;
			print("%s -- > %s"%(fn, newname))
			os.rename(fn, newname)
			break

